In [2]:
import numpy as np
import pandas as pd

df = pd.read_csv("C:\SemV\DAV\P8Family.csv")
df

    Name Gender  MonthlyIncome
0   Shah      M         114000
1   Vats      M          65000
2   Vats      F          43150
3  Kumar      F          69500
4   Vats      F         155000
5  Kumar      M         103000
6   Shah      M          55000
7   Shah      F         112400
8  Kumar      F          81030
9   Vats      M          71900

In [3]:
#a
df.groupby('Name')['MonthlyIncome'].sum()

Name
Kumar    253530
Shah     281400
Vats     335050
Name: MonthlyIncome, dtype: int64

In [4]:
#b
df1 = pd.DataFrame(df.groupby('Name')['MonthlyIncome'].max())
df1

       MonthlyIncome
Name
Kumar         103000
Shah          114000
Vats          155000

In [5]:
#c
df[df['MonthlyIncome'] > 60000]

    Name Gender  MonthlyIncome
0   Shah      M         114000
1   Vats      M          65000
3  Kumar      F          69500
4   Vats      F         155000
5  Kumar      M         103000
7   Shah      F         112400
8  Kumar      F          81030
9   Vats      M          71900

In [7]:
#d
df[(df['Name'] == 'Shah') & (df['Gender'] == 'F')]['MonthlyIncome'].mean()

112400.0